In [2]:
print('Week 3 Day 1')

Week 3 Day 1

In [3]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Ella'],
    'Age': [25, 30, 35, 40, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, 120000, 110000, 95000]
}

df = pd.DataFrame(data)
df.head(3)

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000

In [4]:
df.to_csv('employees.csv', index=False)

In [5]:
df.to_excel('employees.xlsx', index=False)

In [6]:
df[df.Age > 30]

      Name  Age     City  Salary
2  Charlie   35  Chicago  120000
3    David   40  Houston  110000

In [7]:
df.query("Age > 30")

      Name  Age     City  Salary
2  Charlie   35  Chicago  120000
3    David   40  Houston  110000

In [8]:
df[['Age', 'City']]

   Age         City
0   25     New York
1   30  Los Angeles
2   35      Chicago
3   40      Houston
4   29      Phoenix

In [9]:
df.iloc[1:3]

      Name  Age         City  Salary
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000

In [10]:
df.query("Salary > 90000")

      Name  Age     City  Salary
2  Charlie   35  Chicago  120000
3    David   40  Houston  110000
4     Ella   29  Phoenix   95000

In [11]:
df.query("City == 'New York'")

    Name  Age      City  Salary
0  Alice   25  New York   70000

In [12]:
df.query("Age == 30-1")

   Name  Age     City  Salary
4  Ella   29  Phoenix   95000

In [14]:
df

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   40      Houston  110000
4     Ella   29      Phoenix   95000

In [15]:
df.drop(2, axis=0, inplace=True)

In [44]:
me = 'Ali'
you = 'Baloch'

for i,  me in enumerate(you, 1):
    print(i,':', you , end= ' ')

1 : Baloch 2 : Baloch 3 : Baloch 4 : Baloch 5 : Baloch 6 : Baloch